[
  {
    "nome": "advogado_conta",
    "hashtags_pesquisa": ["blender3d", "isometric"],
    "usernames": ["natgeo", "nasa"],
    "prompt_ia_geracao_conteudo": "Crie um post sobre tendências em direito digital...",
    "prompt_ia_legenda": "Resuma o conteúdo sobre direito digital em uma legenda...",
    "supabase_url": "",
    "supabase_service_key": "",
    "supabase_bucket": "",
    "disable_replicate": false
  },
  {
    "nome": "dentista_conta",
    "hashtags_pesquisa": ["blender3d", "isometric"],
    "usernames": ["natgeo", "nasa"],
    "prompt_ia_geracao_conteudo": "Crie um post sobre dicas de higiene bucal...",
    "prompt_ia_legenda": "Resuma o conteúdo sobre higiene bucal em uma legenda...",
    "supabase_url": "",
    "supabase_service_key": "",
    "supabase_bucket": "",
    "disable_replicate": true
  }
  ,
  {
    "nome": "Milton_Albanez",
    "hashtags_pesquisa": ["empreendedorismo", "coaching", "pnl", "desenvolvimento pessoal"],
    "usernames": ["milton_albanez"],
    "prompt_ia_geracao_conteudo": "Descreva a imagem em português (Brasil) de forma clara e objetiva. Foque em paisagens naturais (montanhas, florestas, praias, campos) e animais fofinhos (filhotes, animais dóceis), conectando os elementos visuais diretamente à mensagem escrita. Evite objetos aleatórios fora de contexto. Se a imagem for abstrata, destaque cores e formas em relação ao tema; se for concreta, descreva o que representa no contexto de crescimento, equilíbrio e alta performance, mantendo coerência com o texto original.",
    "prompt_ia_replicate": "Paisagem natural serena ou animal fofinho em cenário natural. Estilo minimalista e harmonioso. Sem objetos aleatórios, sem elementos urbanos dominantes, sem pessoas. Cores suaves, composição limpa. Metáfora de crescimento, foco e equilíbrio. Ajuste a cena para refletir o tema do texto original sem literalidade excessiva.",
    "prompt_ia_legenda": "Você é um Estrategista de Conteúdo Sênior, focado em Coaching, PNL e Desenvolvimento Pessoal para Empreendedores.\n\n**Tarefa:** Crie uma legenda de Instagram profissional, prática e com propósito, baseada na {descricao} e no {texto_original}.\n\n**Restrições e Estilo:**\n 1.  **Evite Clichês:** Não use frases motivacionais óbvias como \"Transforme seus sonhos!\" ou \"Acredite em si mesmo!\". O conteúdo deve ser *concreto*.\n 2.  **Foco em Ação:** Transforme a descrição da imagem e a inspiração do texto original em uma **dica, método ou reflexão profunda** sobre um dos temas (Coaching, PNL, Desenvolvimento Pessoal) que seja imediatamente aplicável ao empreendedor.\n 3.  **Estrutura:** * **Gancho (1ª Linha):** Uma frase que desafie uma crença comum do empreendedor.\n      * **Corpo (Desenvolvimento):** Explique como o conceito de PNL ou Coaching se aplica à situação descrita na imagem/texto.\n      * **Chamada para Ação (CTA):** Uma pergunta direta que incite a reflexão ou o comentário do público.\n 4.  **Hashtags:** Use as hashtags fornecidas: #Empreendedorismo #Coaching #PNL #DesenvolvimentoPessoal #SucessoDigital #JornadaEmpreendedora. Inclua 1 hashtag adicional que se relacione diretamente com a dica prática.\n\n**Dados Disponíveis:**\n - **DESCRIÇÃO DA IMAGEM:** {descricao}\n - **TEXTO ORIGINAL COLETADO:** {texto_original}\n\nSaída final: apenas a legenda pronta, sem explicações.",
    "disable_replicate": false
  }
]