[
  {
    "nome": "Milton_Albanez",
    "hashtags_pesquisa": ["empreendedorismo", "coaching", "pnl", "desenvolvimento pessoal"],
    "usernames": ["milton_albanez"],
    "instagram_id": "17841404919106588",
    "instagram_access_token": "EAAKXup1fjNIBPphQVRWxFKWksE1Gptksm7nBpYAFh3t01Y3XvnyXmHCCim0gZAZAZAZBDTFLHkCkVVP5bJ73ltbA9JMLhvroZCM5LAeSPpQLJZCPcKkOOKLFS4n3SViRQx8cPFTsjCYZAWrxV4bIUuPrZCJmi8Q11KjVuy4d5ZAIV3UMSfZBFwgsfU3h1c1TEEC8yZBOatvmRq0fTLpuEck",
    "prompt_ia_geracao_conteudo": "Descreva a imagem em português (Brasil) de forma clara e objetiva. Se a imagem for abstrata, descreva os elementos e as cores. Se a imagem for concreta, descreva o objeto e o que ele representa metaforicamente no contexto de crescimento e alta performance. Conecte sempre os elementos visuais a conceitos de desenvolvimento pessoal, liderança e transformação empresarial. Evite descrições puramente físicas - inclua sempre o significado simbólico dos elementos na jornada empreendedora.",
    "prompt_ia_replicate": "Imagem conceitual e profissional representando crescimento, liderança e transformação. VARIEDADE VISUAL: Alternar entre: 1) Paisagens naturais (montanhas, árvores, caminhos) simbolizando crescimento orgânico; 2) Elementos urbanos/corporativos (arranha-céus, pontes, escaladas) representando ambição e estrutura; 3) Elementos humanos abstratos (silhuetas, mãos, sombras) indicando liderança; 4) Conceitos minimalistas (formas geométricas, gradientes, luz/sombra) para reflexão profunda. Estilo: clean, moderno, inspiracional, profissional. Cores: tons terrosos, azuis profundos, verdes naturais, cinzas elegantes, dourados sutis. Evitar: rostos definidos, objetos literais óbvios, clichês visuais. Foco em metáforas visuais de alta performance, desenvolvimento pessoal e sucesso empresarial.",
    "prompt_ia_legenda": "Você é um Estrategista de Conteúdo Sênior, focado em Coaching, PNL e Desenvolvimento Pessoal para Empreendedores.\n\n**Tarefa:** Crie uma legenda de Instagram profissional, prática e com propósito, baseada na {descricao} e no {texto_original}.\n\n**Restrições e Estilo:**\n 1.  **Evite Clichês:** Não use frases motivacionais óbvias como \"Transforme seus sonhos!\" ou \"Acredite em si mesmo!\". O conteúdo deve ser *concreto*.\n 2.  **Foco em Ação:** Transforme a descrição da imagem e a inspiração do texto original em uma **dica, método ou reflexão profunda** sobre um dos temas (Coaching, PNL, Desenvolvimento Pessoal) que seja imediatamente aplicável ao empreendedor.\n 3.  **Estrutura:** * **Gancho (1ª Linha):** Uma frase que desafie uma crença comum do empreendedor.\n      * **Corpo (Desenvolvimento):** Explique como o conceito de PNL ou Coaching se aplica à situação descrita na imagem/texto.\n      * **Chamada para Ação (CTA):** Uma pergunta direta que incite a reflexão ou o comentário do público.\n 4.  **Hashtags Dinâmicas:** Use as hashtags base: #Empreendedorismo #Coaching #PNL #DesenvolvimentoPessoal #SucessoDigital #JornadaEmpreendedora. ADICIONE hashtags contextuais baseadas no conteúdo (ex: se falar de liderança, adicione #LiderancaAutentica; se falar de vendas, #VendasEstrategicas; se falar de mindset, #MindsetVencedor). Inclua também 1-2 hashtags sazonais ou do dia da semana quando apropriado (ex: #SegundaMotivacional, #NovoAno, #UltimoTrimestre). Total: 8-10 hashtags variadas e relevantes.\n\n**Dados Disponíveis:**\n - **DESCRIÇÃO DA IMAGEM:** {descricao}\n - **TEXTO ORIGINAL COLETADO:** {texto_original}\n\nSaída final: apenas a legenda pronta, sem explicações.",
    "supabase_url": "",
    "supabase_service_key": "",
    "supabase_bucket": "",
    "superior_concepts_enabled": true,
    "superior_concepts_probability": 0.7,
    "disable_replicate": false
  },
  {
    "nome": "Albanez Assistência Técnica",
    "hashtags_pesquisa": ["assistencia tecnica", "eletrodomesticos", "conserto", "manutencao"],
    "usernames": ["albanez_assistencia"],
    "instagram_id": "17841419226912347",
    "instagram_access_token": "EAATUNTHpgXYBPu1rW0AdZAapngrofXVaukbJfXCFL08v0lfSGocFZCmkn5UT7Qxy48ctJ4RRiWwWKICWpgrKfQLXhLmLt898dupeZCfJynjAdFTDzZChul8sICW63GUv0BDN6Aqs8JxhJUZBGk6WV8hjw8eOil8AmXXoaZA5mUTb4bcbpR3iTytGgpV6CT2qkBhXUajKNsv1PO91YK",
    "prompt_ia_geracao_conteudo": "Descreva a imagem em português (Brasil) de forma clara e objetiva. Se a imagem for abstrata, descreva os elementos e as cores. Se a imagem for concreta, descreva o objeto e o que ele representa no contexto de assistência técnica e manutenção de eletrodomésticos. Conecte sempre os elementos visuais a conceitos de qualidade, confiança e expertise técnica. Evite descrições puramente físicas - inclua sempre o significado prático dos elementos no contexto de serviços técnicos.",
    "prompt_ia_replicate": "Imagem profissional e técnica representando assistência técnica, manutenção e qualidade. VARIEDADE VISUAL: Alternar entre: 1) Ferramentas e equipamentos técnicos (chaves de fenda, multímetros, peças) simbolizando expertise; 2) Eletrodomésticos modernos (geladeiras, máquinas de lavar, micro-ondas) representando o foco do negócio; 3) Elementos de confiança (mãos trabalhando, certificados, garantia) indicando qualidade; 4) Conceitos de eficiência (engrenagens, circuitos, tecnologia) para modernidade. Estilo: clean, profissional, técnico, confiável. Cores: azuis técnicos, cinzas metálicos, verdes de qualidade, brancos limpos, laranjas de energia. Evitar: rostos definidos, objetos quebrados, ambientes sujos. Foco em competência técnica, modernidade e confiabilidade.",
    "prompt_ia_legenda": "Você é um Especialista em Marketing para Assistência Técnica, focado em Eletrodomésticos e Serviços Técnicos.\n\n**Tarefa:** Crie uma legenda de Instagram profissional, educativa e confiável, baseada na {descricao} e no {texto_original}.\n\n**Restrições e Estilo:**\n 1.  **Evite Vendas Diretas:** Não use frases promocionais óbvias como \"Melhor preço!\" ou \"Ligue já!\". O conteúdo deve ser *educativo*.\n 2.  **Foco em Valor:** Transforme a descrição da imagem e a inspiração do texto original em uma **dica técnica, orientação de manutenção ou informação útil** sobre eletrodomésticos que seja imediatamente aplicável ao cliente.\n 3.  **Estrutura:** * **Gancho (1ª Linha):** Uma pergunta ou fato técnico que desperte curiosidade.\n      * **Corpo (Desenvolvimento):** Explique como o conceito técnico se aplica à situação descrita na imagem/texto, oferecendo valor educativo.\n      * **Chamada para Ação (CTA):** Uma pergunta que incentive o compartilhamento de experiências ou dúvidas técnicas.\n 4.  **Hashtags Dinâmicas:** Use as hashtags base: #AssistenciaTecnica #Eletrodomesticos #Manutencao #DicasTecnicas #QualidadeGarantida #ServicoEspecializado. ADICIONE hashtags contextuais baseadas no conteúdo (ex: se falar de geladeira, adicione #Refrigeracao; se falar de máquina de lavar, #LavadoraRoupas; se falar de micro-ondas, #MicroOndas). Inclua também hashtags locais quando apropriado. Total: 8-10 hashtags variadas e relevantes.\n\n**Dados Disponíveis:**\n - **DESCRIÇÃO DA IMAGEM:** {descricao}\n - **TEXTO ORIGINAL COLETADO:** {texto_original}\n\nSaída final: apenas a legenda pronta, sem explicações.",
    "supabase_url": "",
    "supabase_service_key": "",
    "supabase_bucket": "",
    "superior_concepts_enabled": false,
    "superior_concepts_probability": 0.3,
    "disable_replicate": false
  }
]